
[
    "Even though lots of folks are navigating something similar, how each person deals with it is usually pretty unique to the individual. Consider talking to someone - this is free through RPI, totally confidential, etc.: https://studenthealth.rpi.edu/list-services/mental-health-counseling-services/mantra-health\n\n\nGood luck",
    "Thank you so much :)",
    "Controlling distractions is key to succeeding in college, and in many other aspects of life. Lots of genuinely smart people have struggled at RPI over the decades. You are definitely not alone in this!",
    "I’m convinced it’s at least partially the weather",
    "I agree bc ever since the sun started setting earlier, I’ve been cooked",
    "Hi,\n\nI’m a graduate student here. I’ve been diagnosed with ADHD as well as generalized anxiety since age eight and have been taking medications for it since then. If you are taking meds, this may apply to you. Otherwise, just read the very last two sentences of this comment.\n\nI was told recently by my psychiatrist that when your brain stops developing (18-24 years), it’s possible that certain prescribed SSRIs or other medications used for ADD/ADHD (e.g., Ritalin) may become less effective and that you may want to change your meds up to better fit your adult brain.\n\nFor me, it was a switch from Ritalin to Adderall and from Zoloft to Lexapro that seemed to do the trick. However, it took me YEARS of struggling and several hospital visits to figure this out. Don’t wait for it to get as bad as I did. Go now and tell them that you aren’t feeling right because they will put you on medication/change it for you if you talk to them and tell them exactly how you feel.",
    "There’s an extra scholarship",
    "Is it significant? I feel like I could get more aid with a higher act score, I’m just not sure about the admissions rate.",
    "My year it was $5k per year for students who applied early action and were accepted. Weirdly, I can't find any info about it on RPI websites, though. I would check with the Financial Aid office to see if they're offering it, since $20k over four years is not an insignificant sum.",
    "So my next question is could I get in with my current stats? I have an average gpa for the school, 29 ACT and good ECs. I don’t know if it’s a good idea to take the risk and apply when I could improve my act score a good bit for rd.",
    "I mean RPI has a very high acceptance rate, so it's not the biggest risk in the world. I don't think I'd be able to give advice on that though.",
    "Right, but the average act is much higher than mine. Thanks for letting me know about the ea scholarship!",
    "Early Action, a 29 is already a really good ACT score like 90th percentile. There is not a huge jump between EA and RD. But I don't think the delta increase in your changes from your (act scores) is going to be bigger than EA to regular decision. plus you get a bit more money for EA. Also there is an official way to send additional score results.",
    "Right but the reported averages are a decent bit higher for engineering at rpi. I just don’t want to risk getting declined if the rd and ea acceptance rates are relatively the same.",
    "RPI has a reputation for rigor. Schools and employers tend to know this, especially if they're big enough to have dealt with our alumni in the past.",
    "Big enough to have dealt with alumni and have enough leeway in the hiring process",
    "RPI is hard and less forgiving than other universities. \n\nGrain of salt, but I read a post on here once about someone who got into grad school with a 3.0 from RPI and their friend at Georgia Tech with a 3.5 didn’t get into the same program, so schools may be aware of our rigor and give us some slack for it.",
    "Part of the answer is that there are plenty of people with GPAs good enough for grad school. Maybe they swim in different social circles than you, or you just don't have a big enough sample size, but they're definitely out there. It is a fact though that RPI over the decades has had less grade inflation than most peer institutions.",
    "Lol yeah i just wish i still had my 3.7 ;(",
    "They report the average GPA as about 3.1 which seems reasonable for a difficult school. \nhttps://rpi.app.box.com/s/sd5sssth3gwdpj1phsbsl44mxkzfdga3",
    "I saw an Archie with a 4.1 \nLike whatttt",
    "That’s crazy",
    "Schools know RPI is tough.  If you got into RPI you probably will do well on GREs or GMATs which are also used in many grad school admissions processes and will help substantiate that you’re qualified.  Also should you be thinking of grad school, you’ll need recommendations so make it a point to make a favorable impression on a favorite professor or two.",
    "That’s true! You have a good point",
    "Have you tried ALAC tutoring?",
    "I haveeeeee :(",
    "I'm currently using Troy Tutors for Thermo, strenghts, phys II and multivar, the tutors are excellent !",
    "While I didn't get my BS in BSAN, a glance at the catalog shows a lot of overlap of my undergrad. I also did get my MS in it, so while I'm sure it's not quite the same there should be some general overlap. Happy to answer any specific questions if you have any, but will give some general tips:\n\nI recommend taking some Comp Sci classes or learning some on your own. Will be very helpful, especially later on in the program re: Machine Learning and Data Resource Management. From my understanding, you only really need Python and SQL.\n\nIf you struggle with math, I'd recommend brushing up on it as much as you can. Khan academy is a great resource, and MIT has a bunch of lectures on YouTube, but in general I didn't find most of the BSAN/non-theoretical math very difficult, but YMMV.",
    "Thank you! Planning to get most of the math out of the way at CC now but obviously still have some ahead of me so i’ll be sure to check out those resources.",
    "I would recommend taking at least the upper level (beyond Calc 2) math courses at RPI if you can, but I wouldn't blame you if you did that at your CC",
    "Hi! I’m Lynda from the Lally School of Management here at RPI. Great to hear you’re interested in Business Analytics. You’re right — RPI’s tech-driven environment really shapes how we at Lally approach business education. The coursework is rigorous but gives you plenty of hands-on experience with analytics, data tools, and real-world problem-solving.\n\nHappy to answer any questions about the program or the transfer process. Feel free to DM me here or email me at [**holtl3@rpi.edu**]() if that’s easier.",
    "I am currently bsan &amp; I definitely recommend brushing up on your coding skills because data structures and CS 1 is a requirement for the BSAN to graduate! Same with math, bc u have to take calc 1, 2 &amp; 3 if I were you I’d definitely take data structures at CC if you can before you transfer or maybe take it in the summer because the grade average is below 50 for certain exams lol I can tell you more if you want about curriculum and etc!",
    "Man, I feel like visiting RPI just to see TMC again. Those dudes were a highlight to my college experience.",
    "Oh man, TMC and Khao Soi (also my favorite Thai dish)...makes me want to take a trip back to Troy!",
    "Where are you guys located?",
    "Good Food Market at Capital Roots - 598 River St, Troy",
    "The specific Rock Raiders group has since gone defunct, but there is still a very active robotics club at RPI. I’m an alumn, but you can find the active members at https://discord.gg/DPWMz5BqZP",
    "Thanks!",
    "Not until the middle of Spring semester (late March/early April), but the trend for the last few years has been tuition increase by 2k/year and housing+meal plan increase by 1k/year ",
    "Thanks - helpful to have an idea",
    "FOCS is a prereq for MFML and DS is a prereq for FOCS, so there is no way to take them in the same semester. ",
    "That's because Stony Brook is a state school",
    "Yeah I know Siena didn’t have it off either, so it’s def a state school thing",
    "Only SUNY schools have it off.   Most colleges dont close for Veterans Day (or Columbus Day)",
    "Though RPI at least does do Columbus Day",
    "SUNY New Paltz and SUNY Albany both had classes.  I think it's on a school by school basis.",
    "Engineering degree?  \n\nJust wait until you enter the workforce.  My first job I had 5 holidays all year, the plant was open until 6pm on Christmas and New Year’s Eve.\n\nMy current job is better, we get a week for the holidays but the truth is there are still people who go in to work.",
    "“You ain’t work a 48 hour shift in your life brother”",
    "Trust me, there is no easier day in the office than New Year’s Eve.  Problem is you get real bored real quick.",
    "That’s so crazy",
    "This is really cool! Thanks for sharing",
    "I know a guy who runs it, if someone's interested in starting something smaller scale at RPI dm me and I could probably connect you.",
    "It’s not that much work. I’m not really sure why it’s listed as communication intensive since we only had to write one 5 page paper",
    "I walk past the gate house all the time. I have restored similar homes in the area from the 1890s. Frankly, it would be easier and more cost effective to make a high-fidelity replica than to try to resolve the framing and structural issues. The carpentry elements of the exterior are actually quite simple to reproduce; you wouldn't need a master finish carpenter for the millwork or anything. It's a lovely building and I'd love to see it rebuilt and have the structure be safe for students to use.",
    "No one is targeting trans students, its just a bad site with numerous design issues. The old version was 10x better. Perfect example of if it ain’t broke don’t fix it.",
    "I have a friend on student government that's been part of a push to use preferred names wherever possible. They told me that the usage of legal names on the new SIS is an oversight and that the Registrar was made aware of the problem in the last few weeks and is working on fixing it. It's a new system and they just didn't do a good job in the transition. It's disappointing, but I assure you it's not malice, just a technical mishap that will hopefully be fixed very soon.",
    "Yeah, no idea who you are but you're right on it. I'm the chair of the Senate's Student Life Committee, and I brought this issue up to DotCIO several weeks back, and then it got kicked to the Registrar's office. I mentioned it to the Registrar on Thursday and they are working on it. We'll keep following up until it's fixed. Reach out to me (noblez@rpi.edu) or someone on the Senate if you have additional questions.",
    "They've been aware of it for much longer than that, I know because trans students have been trying to get it changed for much longer than that. This is 100x worse than that, though. Legal sex is harder to change than legal name. I'm from a state that bans it so I can't change my legal sex until I permanently move, period. Every state allows name changes. This completely outs you to professors, and to any students who see a roster (eg. in courses that take attendance). Being outed is dangerous, this is putting trans students at RPI in harm's way\n\nLast semester we were explicitly told that they \"were working on\" not printing deadnames on packages picked up from the mail center, and they still do that. How long do I need to wait before my privacy and safety stops being compromised? Maybe it will be done next semester, I just need to hope no one decides to harass me in the meantime? It was completely fine before. They broke it, apparently didn't test it or put any thought into it, and now we have to wait God only knows how long for them to fix it while it fucks up our lives in the meantime.",
    "I can talk about the packages as well, actually. I met with the director of the mail center and someone else in the auxiliary services division (forgot his title sorry) a few weeks ago. Banner, the school's database, holds fields for preferred and legal name. For most things, like rosters and hopefully SIS, the change is just pulling the preferred name instead of legal.\n\nThe mailroom is an exception to this because if we alter the data going into the software, it will make it impossible in some cases for them to determine the intended recipient of a package. Sometimes people address mail to someone's preferred name, sometimes legal, and there are a lot of people with very similar names. They showed me the system and the process for finding people, and it was clear they needed both.\n\nThe other option is to alter how the software prints labels once the recipient has been selected. This is possible in theory, but we license the software from an external company, so we're working with people outside the Institute. I've drafted an email to their support line, and I'm waiting for the GM to read it over before I send it. No idea what they'll say, so no promises on the mailroom, but we are trying.",
    "The mailroom thing isn't as important as this, but fixing this *can't* take as long as other stuff. Imagine if they added a feature that puts everyone's sexual orientation in front of their name, and then sorts the class rosters by orientation. It would be completely insane and there would be tons of pressure for them to change it because of how completely horrible it would be for gay students. What they did is just as bad as that for trans students. This needs to be fixed ASAP",
    "They’re working on it",
    "Your concerns are completely valid, especially with the situation in the country the way it is. Over the summer, stugov complained about professor/RA attendance lists and the mail room to upper admin. Most of the things you're saying now were also said then, and I was told that admin had made several changes to correct these problems, and was working on doing more. This was before new SIS, which is just new-system jank in the worst possible place.\n\nIt's disappointing that they haven't gone anywhere since then on many of those issues, but if you reach out to student government members with details, they'll find the administrators who oversee those things and agitate until they get fixed. The trouble is that with the administration as big as it is, someone high-level can say \"this is very important, fix it\" and then nothing happens because the lower-level people never get the same message. It's unacceptable considering what's at stake, obviously, and you're completely right to be pissed with them being this sloppy with something so important.\n\n(I was going to write something here about packages but apparently someone answered it before I could)",
    "STAR (trans club on campus) is going to send a letter tomorrow, it's just upsetting and based on past experiences I have doubts they'll do anything in the appropriate timeframe. Meanwhile I've been outed to every professor, and I'll be outed to the next batch unless they fix this before January :/",
    "I hate the new sis portal, I miss the old looking site which looks like it's been dug up from the annals of Internet history. Also I can't find where all the tabs are.",
    "The new SIS is terrible for a lot of different reasons, but this just makes it worse now that I know about it. It’s the same bullshit service used in some cheap community colleges too.",
    "Could you send me a screenshot? With names blocked out is fine. I'm part of the alumni LGBTQ affinity group and I'll be sure to bring it up at our meeting tomorrow. There is a lot of interest among the alumni in the group for advocating for our current students.",
    "STAR and Student Gov emailed them, and thankfully they were able to fix it very quickly. It was probably some toggle that was enabled for some reason, but it's gone now. I'm (happily) surprised they fixed it so quickly",
    "Phew! Any issues, feel free to communicate! I think Chaz's email is listed under the affinity group online--he's a former RPA president. A couple members are also RAA board members. I check this reddit account with some regularity.",
    "(and if you can't figure out how to block names out, I can throw it in photoshop before I share it with anyone)",
    "Small update: the honorific has been removed. They are working on preferred names.",
    "Dropped out of RPI a few yrs ago and i gotta say this tracks there were so many oversights like this. cant let the SIS man keep us down tho we keep on trucking",
    "They are buying discount software platforms rather than investing in packages that would address these matters (and generally make your life easier.)",
    "I don't know if Banner, which powers SIS, is a discount software platform.  But, I do know that years of staff and budget cuts within DotCIO mean that the system admins don't have the manpower to make the switch to another system or write one themselves.  And, yes, I know this sounds like an excuse.  It's still true, though.",
    "You're getting downvoted but you're mostly correct. The Registrar is known for cutting corners and it's blatant in this case",
    "Wow...I worked on implementing BANNER on a SUNY campus back in the early 90's.  Still running on VAX/VMS?  Lol!!  Some of this boils down to bad queries and sorting/printing the output, it really should be that hard to fix.",
    "Is it possible to change your pronouns or preferred title instead of just changing your gender?",
    "It is possible to change your pronoun and preferred first name (and gender).  For students, the preferred first name change request needs approval from the Registrars office.  That has been in place for a few years.  In addition, the ability to select your prefix (honorific) was enabled yesterday.\n\nA second issue is how and where Banner/SIS uses these fields.  There are folks working on this now - I am not up on the details as I work on the directory side of things.  At this point, the prefix (honorific) is not included in the online directory, but that may change eventually.",
    "No",
    "If you google RPI transfer classes you can find a list of courses that transfer from different colleges, or request that a course be evaluated. I think it’s with the registrars office.",
    "https://tes.collegesource.com/publicview/TES_publicview01.aspx?rid=f080a477-bff8-46df-a5b2-25e9affdd4ed&amp;aid=27b576bb-cd07-4e57-84d0-37475fde70ce",
    "Every Clarkson student can attend their games for free with a student ID. If RPI was serious about having a student presence then they should do the same.",
    "Wait we have to pay to go to games? Wtf!? (Coming from someone who never has and never plans to lmao)",
    "Yes, and given this news I'm guessing the long tradition of hockey line is dead.  We (students) used to campout for weeks in a line wrapped around the student union to purchase hockey tickets.",
    "I waited in hockey line in 1992 and bought season tickets for $40. Today I buy tickets for my family for one game and it’s $80.",
    "Hockey Line was on life support and Covid pulled the plug.",
    "That’s too bad, I did hockey line with friends in 1994. Only a night or two but it was still an event.",
    "I get it and I don't get it.\n\nI get it because this team has been kicking me in the balls for almost a quarter-century now. I'm '06 and they haven't made a league semi-final (a stage, you'll note, that a full third of the league reaches every year) since I enrolled. They haven't scored a goal in the NCAA tournament since I was six months old. At a certain point it feels like an exercise in futility.\n\nI don't get it because I had season tickets my last three years at RPI, and I've traveled to see the team not only at Union, but also in Detroit (GLI) and at Minnesota, St. Cloud, UConn, Notre Dame, Miami (Ohio), Denver, Colorado College, Arizona State, and Fairbanks. And there's a lot of incredible memories there. Some of those revolve around wins, sure, but by no means all. \n\nSo you should go, yell about how much Clarkson sucks, and have a good time. If and when things improve, you can say you were there when things were crap.",
    "Was at the blackout game with a group of 12. Most of their first time. The team had little to no fight, hard to make fans when they go out and play 1/3 of a game. I had season tickets 3 years as a student but haven’t been able to get out to many of the games this semester. Are we back?\n\nI love RPI hockey. It’s embarrassing that we have such a good culture and history but the large majority of the student population does not care. Needs to be fixed, but how?",
    "We’re 2-2-0 so it’s hard to say if we’re “back”. But Clarkson was the second best team in the league last year, we *definitely* weren’t expected to beat them 5–1 tonight. It’s a great sign if we can keep it up.\n\nMarty has made it a priority to turn things around, and we’re planning on investing in major upgrades to the field house… but students can’t be bothered to show up for our biggest rivalry? I dunno. It’s not a good look. Making attendance free for students might be the way to go.\n\n(For anyone wanting to get into RPI hockey I recommend following “The Field House” on substack, https://open.substack.com/pub/thefieldhouse)",
    "It feels like to me that our biggest rivalry is Union, not Clarkson.",
    "Lately, yeah. One is our tech school rival, the other our geographical neighbor rival. Turns out there’s wikipedia pages for both\n\n[Clarkson–RPI men's ice hockey rivalry](https://en.wikipedia.org/wiki/Clarkson%E2%80%93RPI_men's_ice_hockey_rivalry)\n\n[RPI–Union men's ice hockey rivalry](https://en.wikipedia.org/wiki/RPI%E2%80%93Union_men's_ice_hockey_rivalry)\n\nUnion rivalry gets a big boost from the Mayor’s Cup. But when there’s 1 minute left in play our pep band holds up “Clarkson Still Sucks” signs, regardless of who we’re playing.",
    "RPI pep band says that even when they are at away games, with one notable exception for when they play at RIT, but thats a different story. ",
    "yeah and i don’t get that, the band should put Union still sucks, i personally dislike them way more since local rivalry",
    "What is csys",
    "CSE, idk why but they used to call it CSYS freshman year, I should update it",
    "former rpi pep band manager here, just know that they're trying their best and are always open for new people to join 💕💕",
    "Would also like to point out that we definitely had more members attending tonight than the Clarkson pep band 🙂",
    "I first read this as the hockey team is looking for new people to join - with 19 players from the transfer portal  - this is also true.",
    "Keep winning at a consistent pace and they'll get the fans back",
    "I already feel bad when I go to an RPI Hockey game. Why should I feel bad for not going? \n\nAlso there are a multitude of other reasons why RPI's Hockey attendance is so low:\n\n1. Games are $6 for students. That's too high if you want students in there every weekend.\n2. RPI plays horribly. They have a record of 2-8 total, or 2-2 in the division. No one wants to spend time and money to watch a team that won't do anything worthwhile.\n3. The ECAC is sorely behind the times. Each barn in the division may be nostalgic, but compared to other D1 schools, RPI is lacking the facilities to draw students. \n4. RPI is always in crunch time with homework. Plus, it's midterm season for 8 weeks of the semester. Who has time to go to a game when students have to spend the whole weekend studying or working?\n5. Theres a lack of care put into jerseys or merchandise. I can barely get a jersey, and if i even got one, they dont really look that good. Bring back puckman on the jerseys. \n\nThere's more issues present, but those are the biggest ones I can name off the top of my head.",
    "Some very good points...\n\n1. Agreed, games should to be cheaper/free until demand is greater than supply.\n2. 2-2-0 is a decent conference record for this early in the season. Only one other team has played 4 conference games... Union. They are also 2-2-0. Believe it or not, we are currently in a 3-way tie for first place in the league with 6 points, along with Dartmouth and Union. Will that last? Almost certainly not. But this is actually an exciting time to show up to the field house, moreso than just about any time in the last 5 years.\n3. I don't know the exact details but upgrading the field house is explicitly listed as a priority in Marty's \"RPI Forward\" campaign.\n4. Clarkson presumably has similar academic demands as RPI. Not saying it's identical but they're not a party school. Their hockey culture is on another tier, but it's actually just the tier that RPI *used to be at*.\n5. Hard agree on this one. I'd love to buy on-ice jerseys rather than the cheap pajama version that they sell for fans. I'd pay top dollar, especially if they bring back puckman.",
    "Glad we're on the same page. Personally I'd love to be at every game, but money/homework really gets in the way. Especially as an Archi",
    "For some reason, I feel like more students would go if you could drink a beer in the stands. Yknow, like other venues",
    "That would help, but drinking amongst Gen Z is the lowest of any generation. You'd only be able to bring in on average about 40% of people over 21 with that. So, like, maybe 500 people? And how many of those people would even be interested in a drunken hockey game when the pressure to perform academically in a slumping economy is at an all-time high?",
    "I didn't even know that the RPI hockey team was even playing. Also most of the people who get into RPI are not super into sports and there are a lot of introverts so we do not have much a a sports culture like a lot of other colleges.",
    "RPI had the best college hockey pep band/student section in the 90’s/00’s. \n\nPut the band back behind the goal!!",
    "Back in the 80s not much of a sports culture either...except for hockey!!!",
    "I graduated 20 years ago and recently was sent pictures from the Alumni Weekend' game. It was horrifying how empty the field house was.",
    "nobody wants to go, i barely hear anybody talk about going to games and when you do go it’s empty. The freakout game was fun bc every seat was full but in the 80s there was nothing to do except go to the games, unfortunately now the type of kids this school attracts would rather play Valorant or whatever in their rooms on fridays and saturdays. I would go to almost every game if my friends cared but they almost never want to go unless the tickets are free and even then they don’t care about hockey. From what i’ve heard from alumni it used to be awesome but i really don’t see any way this student base would ever care about sports like we used to unless they are a national title contender, maybe. Sucks but what can you do",
    "Yeah, cause everyone studies too much.",
    "I’d have been there if I could have",
    "Considering our home record the last two seasons, I have to give most RPI fans a pass about missing the game...  I dug into our records post-COVID, and here is the data:\n\n&gt; 24-25:  3 wins, 16 home games\n\n&gt; 23-24:  3 wins, 15 home games\n\n&gt; 22-23:  12 wins, 19 home games\n\n&gt; 21-22:  9 wins, 20 home games\n\nSimply put, the team was not doing their part at home the last two years, and it eroded fan support.  Why should folks come out, spend their time and money on an event to only have their spirits crushed repeatedly.\n\nTo be clear, I say this as a season ticket holder since like 2012...  I'm ride or die.  But the vast majority of people aren't, and until the team puts a good product on the ice, I won't give them grief for missing the games.\n\nThat said, I'm cautiously optimistic the last few weeks, seeing us take out Union then Clarkson.  Play has been steadily improving, both in goal, on offense, and on defense too.  Plenty of issues left to address, but we are moving in the right direction.",
    "I would put a year's worth of non-aid tuition that if tickets were free for and they sold and advertised $1 beers, greek life would fill a quarter of the stands alone. Then they invite their non-greek friends because it's a good time and they invite their friends and so on.\n\nAnother solution I thought of is making a big deal out of the opening game of the season, particularly for freshmen, and making that game free. If your first weekend of college you go to an RPI hockey game and have a fun time with friends, you're likely to want to keep going throughout the season. Also first week freshmen are most likely to try new things. Good method of keeping traditions alive too",
    "School spirit and enthusiasm died with raising the drinking age to 21. RPI being a dry campus doesn't help either",
    "When did it become a dry campus?\n\nI dont remember spirit and enthusiasm being dead circa 1988 or so.   Maybe thats because the raise to 21 was just beginning?",
    "Class of '89 so came to the Tute a year after the championship.   Didn't do hockey line nor get season tickets but went to a few games each year, especially Big Red Freakout.  \n\nHad no idea of the state of this today and so sad to hear it.",
    "Want MORE pep band members at games? Consider joining instead of being snarky about it! \n\nsigned, fellow student",
    "They're pretty clearly primarily complaining about the student attendance and not the pep band but ok",
    "&gt;Never mind that the visiting team had a pep band twice the size of ours.\n\nI dunno man, this feels like a dig at the band (who are at almost every single hockey game mind you).",
    "If enough people had been there, this post wouldn't have been made. If we had doubled the size of our pep band but the students were still absent, this post still would have been made.",
    "[deleted]",
    "Sure, the band representing the school that didn't hold a lead for the entire game and lost 5-1 \"brought way more energy\". Half of the people that were sitting in the band section were just fans and didn't even play an instrument!\n\nI'm not disagreeing about student attendance but come to more than one game each semester and you'll see that our pep band shows up CONSISTENTLY.",
    "[deleted]",
    "You can see in your photo that you are literally sitting right next to Clarkson’s band. I’d hope as someone who goes to RPI you can understand the physics of how sound works…",
    "Fun fact: Not my photo, it’s scraped off Facebook.",
    "the hell they did",
    "Not really sure what to tell you.\n\nRPI’s pep band claimed 40 members in 2023\n([source](https://poly.rpi.edu/features/2023/02/years-of-music-with-rensselaers-pep-band/))\n\nClarkson’s pep band claimed 65 members in 2023\n([source](https://www.fisu.net/2023/01/22/clarkson-band-adds-pep-to-team-usa-ice-hockey-games-in-lake-placid/))\n\nShow me a more recent/better comparison and I’m willing to be convinced. The two bands played together on Saturday’s game, I’m sure someone has a photo, I’ll count members.\n\nBut again, this isn’t even the main point of the post.",
    "Dude idk what to tell you. The RPI pep band was there, playing loud and cheering loud. Granted, we also came straight from the football game so we were tired but we were still putting in the effort and *incredibly* excited to be on the winning side of the game for once.\n\nI get it, and I agree with you that it’s sad when there’s a low student turn out to the games. I think most people in the band would agree because we’re *there*. We see it. Every weekend. We volunteer our own time to bring energy, excitement, and school spirit to the games. There’s no incentive for us. (Also for context- we had also spent 8 straight hours in the field house Friday night playing the back to back Women’s and Men’s games.)\n\nYou coming in and making blatantly false statements and passive aggressive digs towards us is really unnecessary and honestly rude and hurtful towards those of us who do put the effort in every week. Let’s keep the topic of this post on RPI’s failings to incentivize students to attend games and build a community of students that’s prideful of its sports.",
    "Why would I pay to watch an 8-2 team? My broke undergraduate ass cannot afford the cost of tickets, and the mental cost of watching them lose dependably.",
    "How much is a ticket these days?",
    "$6 a game.",
    "$6? Can't you just include that with the tuition and fees?",
    "8-2?  That would be a great team to watch!   You meant 2-8 right?",
    "lol, so used to RPI hockey I’m putting failures first",
    "Man getting a few drinks in, heading up to the field house and then screaming abuse at any and all players and refs on the ice was how me and my friends used to unwind after a long week of getting destroyed by our classes.  ",
    "its doable, if you do, take money and banking its basically principles of econ but 4k level",
    "I can’t speak to a lot this but assuming CoCO is like when Rees taught it, it won’t be too bad. That being said (agin assuming it’s like what Rees did) the labs can take a lot of work. My understanding through hearsay is that signals and systems isn’t as bad as circuits, and eprob isn’t too bad. Can’t speak to the Econ classes tho",
    "Oh hell no, how are coco labs compared to emcon? If signals is better than circuits I don't feel horrible about it though, I don't find the course content in circuits too difficult",
    "My experience has been that in emcon you have to spend soooo much time just trying to understand and work inside of Wilt’s framework, where in coco while the labs take time they’re just sorta big projects\nI found them a lot easier then emcon, with the benefit of directly applying what you learn in class as opposed to emcon where you have to do a lot more heavy lifting",
    "You are going to have an easier time answering this question in the Troy subreddit. Not a lot of students are having business lunches.\n\nAlso, it would help if you clarified how close to RPI you want to be. The majority of businesses are downtown, but due to the hill, that isn’t exactly walking distance for the average person",
    "Thanks, good point. Appreciate the response.",
    "Brown's",
    "I was gonna say this. I've never had a business lunch in Troy, but when I have lunch at Brown's I see a lot of people who appear to be on a business lunch.",
    "My group takes seminar speakers out to lunch sometimes and it's always our first pick unless they're closed.",
    "Brown’s is closed on Tuesdays.",
    "Obviously The Ruck",
    "Emry's Garden and Brown's Brewing highly recommended.",
    "Dinosaur bar b cue",
    "Nighthawks\n\nEdit: Sunhee's",
    "When I was out for lunch one day I saw a bunch of interns and their supervisors at Ali Baba. Would recommend for sure.",
    "Truthfully, most of what I consider to be good business places are dinner only (sea smoke, black and blue, etc). I’d recommend looking at Quechua or nighthawks. Eaten at both and think they could fit the bill. \n\nIf you are more interested in the lunch than the business, I generally recommend the Tipsy Moose or Browns, but that’s my personal taste",
    "My favorite restaurant in Troy is Tara Kitchen. They are open for lunch on some days iirc. I'm not sure what qualifies a place for business lunch, but it is a pretty nice place.",
    "I second this, I had lunch here once with my advisor and lab group to celebrate something which is similar to a business lunch type thing",
    "And their food is outrageously good",
    "Ali baba. Nothing else",
    "For corporate gatherings and dinners, I have used Dino BBQ, Browns, and Emry's garden as long as you reserver seats ahead.  Stuff like Nighthawks, sunless, Ali-baba are definitely more casual and sometimes more crowded, so less of a \"business vibe\" than something like Browns.  \n\n  \nIf you want to go more upscale Scarlet Knife or Black and Blue are a bit further away and more fancy steakhouse type places.",
    "Not Konni's, unless you want the air to taste like lemon Lysol.",
    "Had him for NuMPE and IFE. He was cool. Wasn't amazing or terrible. I appreciated the fact that he cared that students understood the subject. I believe he graded *slightly* less strict but I wouldn't expect anything free.\n\nHe still had light in his eyes. Can't say that for all lecturers/profs.",
    "It's normal, I've talked to the science hub and they say its fine. The advisor I've talked to has tried to put in something for it to be fixed, but it hasn't happened for me for at least a year.",
    "I'm a transfer for GSAS coming from a college where I did comp sci. My portfolio had no digital media in it at all. I had half made rules for a tabletop role-playing game, a game concept pitch I made for a different application, custom cards for a card game, and character concepts for Rainbow Six Siege. I don't know if they hold people coming into GSAS for a dual to a higher standard, but having any digital media at all puts you a step above me. I would say try to include some design documentation. Nothing extensive, just enough to explain why you make certain choices. I included that for my character concepts, and I think it helps show you can actually do the design part of the major beyond coming up with ideas. You may be able to ask professors or advistors in the department what they would recommend. Reaching out wirh an email couldn't hurt.",
    "That’s probably fine, if you have any other cool non-game software projects you could include those too.  I think I remember them wanting to wait until I had finished Data Structures before they let me dual major, but maybe that has changed since then. You could also reach out to the head of the program and see what they suggest.",
    "They aren't expecting you to have a ton of experience in game design already, that's what you are there to learn. Show what you have that is relevant, even tangentially. For me going in as a freshman I just showed a few basic 3d models I made and a java program I did in highschool and had no problems getting accepted in 2017.",
    "One of those blocks is a recitation block the other is a test block.",
    "MANE 1010 is required for AERO, ASPC, MECL, and NUCL majors.  They will not be able to register directly for ENGR 1100.",
    "Bro could totally sneak into ALAC lmao the library's open at that hour and nobody would need know they're not an RPI student\n\n(For legal reasons that's a joke)",
    "Explain the obvious joke- what is alac? I clearly want to make sure he never sneaks in, because that would be wrong.",
    "[https://successcenter.rpi.edu/](https://successcenter.rpi.edu/) \n\n  \nWould be better to use UAlbany's services since it's free and you won't be stealing from the RPI kids, but that's just me",
    "I'm a Physics PhD Candidate at RPI and would be more than willing to coordinate tutoring if you're still looking. Feel free to DM!",
    "It was an interesting class. Make sure to go to each lecture or else you fucked. Ask her questions if you are confused and she is helpful.",
    "How difficult would you say the content of the class and tests were?",
    "It is difficult cause it's different from normal calculus, especially with the goddamn residues and poles. Definitely use chatgpt to help simplify the writings which helped with understanding and also talk with the professor she is helpful. But the class can sometimes make you sleepy",
    "I believed u should take either Micro or Macro in order to get econ pathway",
    "But for Macro pls avoid Mina",
    "Hello, is this room still available?",
    "Yes! Please DM me for more information!!",
    "No",
    "Why is the final less of a grade than the other exams? It feels like I'm missing something",
    "Because she doesn't want you to have to stress about it and is just awesome like that",
    "I'm stressing over all the other exams instead &lt;/3 not her fault though",
    "The final is online",
    "BTW it's Diff E Screw 🤓",
    "Posting this for emphasis - this is a big win for RPI Men's Hockey.  After getting beaten down by decent margins up until tonight in the season (by some admittedly good teams), not a lot of folks thought they'd pull it off tonight over in Schenectady.\n\nHowever, not only did they nab their first win of the year, they're 1-0 in ECAC conference play at the moment, and spoiled the first ECAC game at home for Union (a definite plus).  Considering that one of Union's players got a stick to the groin courtesy of an RPI player (who got a 5-minute major penalty and ejected), and that they got embarrassed on their brand-new home rink, Union will be coming for us hard tomorrow.\n\nShow up, be loud, back the team, and let's go for 2-0 in conference.",
    "&gt; Engineers score three shorthanded goals to give Eric Lang first win as RPI coach...\n\n&gt; SCHENECTADY - Eric Lang earned his first victory as RPI men's hockey coach in memorable fashion on Friday night.\n\n&gt; Freshman goalie Nate Krawchuk made 45 saves and the Engineers scored three shorthanded goals in a 5-2 victory over Route 7 rival Union in the ECAC Hockey opener for both teams in front of 2,034 fans at M&amp;T Bank Center.\n\n&gt; The Engineers, who had lost their first six games against a grueling nonconference schedule, improved to 1-6 overall, 1-0 in league play.\n\n&gt; \"Yeah, I've got some pretty neat pucks in the collection, whatever it might look like, but tonight's puck will be pretty special for me,\" Lang said \"It's really good against our crosstown rival. The room was a little emotional.\"\n\n&gt; Lang previously spent nine seasons at American International College, where he won 155 games.\n\n&gt; Union (4-1-1, 0-1) suffered its first loss in a performance that disappointed coach Josh Hauge.\n\n&gt; \"You know you're going to get a great effort from (RPI),\" Hauge said. \"It's ECAC play, and the level definitely steps up. I thought that we did some things tonight where you can't win hockey games if you're going to mismanage the puck and they took advantage.\"\n\n&gt; The game turned in the second period while Union was on a five-minute power play. RPI graduate winger Luciano Wilson received a game misconduct with 6:33 left for using his stick to apparently hit Garnet Chargers defenseman DJ Hart between the legs.\n\n&gt; Union tied the game at 2-2 a minute later on Etienne Lessard's power-play goal, and appeared poised for more with four minutes left on the major.\n\n&gt; But RPI junior winger Ethan Bono responded with a shorthanded goal after Union defenseman Tyler Dunbar lost control of the puck in his own end to give the Engineers the lead for good at 3-2 with 2:13 left in the period.\n\n&gt; \"Obviously, it's not ideal going down for five minutes, but I thought we responded well,\" Bono said. \"The kill was good all night and after they scored that tying goal, we kind of just said we have to lock in here. I thought our kill was great after that, and obviously, that goal felt pretty good. Going ahead on the kill going into the third period is something that we want.\"\n\n&gt; The lead was safe with Krawchuk, a native of Thunder Bay, Ont., who earned his first college victory in an outstanding performance.\n\n&gt; Still protecting a 3-2 lead, Krawchuk and his teammates kept their cool even after Union pulled goalie Cameron Korpi (26 saves) for an extra skater with 2:13 left in regulation. Then RPI's Trevor Russell was whistled for tripping with 1:15 left, putting the Engineers at a 6-on-4 disadvantage.\n\n&gt; \"Obviously, things got a little chaotic, but that's how things happen on the kill, especially 6-on-4 in the last couple of minutes,\" Krawchuk said. \"But you just breathe, take it shot-by-shot, minute-by-minute and don't think about it. Just go out there and play.\"\n\n&gt; RPI sealed the victory with two shorthanded empty-net goals in the final 38.2 seconds, the first by Tyler Wallace and the second from Cole Gordon.\n\n&gt; \"I mean, it sucks,\" Union sophomore winger Connor Smith said. \"They played well, we weren't ready to go. I don't think they're a better team than us.\"\n\n&gt; RPI and Union will meet again Saturday at Houston Field House in Troy.\n\n&gt; \"We're going to be a lot more ready tomorrow,\" Smith said.",
    "LET'S. GO. RED.",
    "Is the game tonight on rpi tv or???",
    "What's the rent",
    "650$ flat",
    "Nice, and what's the layout. How many rooms and bathrooms\nAnd how far is it from the campus?",
    "It is a 2 story house. 4 bedrooms in each floor. 1 bathroom per floor. It is an 11 minute walk from campus.",
    "I may have a good unit for you,\nPlease DM me\nYitzhor ",
    "try toggling all sections",
    "well if your project ever needs a test subject...",
    "I took it a few years ago so it may be different now, but it was pretty low stress. There is an independent project and a group project IIRC but Professor Walf is very passionate and just wants people to learn. I don’t remember ever having issues getting work done, and I took it in my last semester too.",
    "Is much knowledge needed going in? I’ve only taken intro to psychology so I don’t know much",
    "I was a dual with cognitive science so I am not too sure- but if the class doesn’t have specific prerequisites I think you’d be ok",
    "do you know if attendance was mandatory?",
    "&gt; it was pretty low stress\n\nWas it low brain, too?",
    "I also plan on registering for that class. I have had Dr. Walf in the past for behavioral neuroscience and she was a pretty easy going professor. In behav-neuro, she used a total point system and the threshold for an A was something like 70% of total points. Part of her justification was that she taught stress and the brain and knew the negative effects of stress lol.\n\nI can't imagine stress and the brain would be that dissimilar since both are 4000 level psych courses.",
    "Thanks for sharing this.  I checked out the plan because I was curious to see what the project looked like.  It was a bit tough to visualize, but my initial reaction is that it seems like the plan has some good mixed with some not so great scope creep.  \n\nThe idea of creating a better way to enter/exit the Congress St bridge is not a bad one.  I don't know if this plan accomplishes that goal, but it's probably better than the existing traffic pattern.  The Ferry St tunnel has needed repair for a long time so that seems fine.  The ADA and accessibility crossing changes also seem like good improvements to the city.\n\nThe scope creep seems to come from removing a lot of parking and adding what looks like a poorly thought out bike lane.  I'm not a fan of reducing the travel lanes for bike lanes, but I understand that others feel differently.  Regardless, as designed, the bike lane proposed seems like it will increase the number of interactions between bikes and motorists with people getting super frustrated about the worse parking situation, heavier traffic and slower travel times.  I think this will increase friction in the community.\n\nAdditionally, the tree removal seems excessive.\n\nFinally, the idea of people walking/biking in the Ferry St tunnel seems super unsafe.  That spot is going to be prime real estate for panhandlers and opportunistic crime.  Besides, it gives me 'Stephen King in The Stand walking through the Holland Tunnel' vibes.",
    "with you on the tree removal and ADA compliance. I think the bike lane should be kept, having dedicated bike lanes like these aren't seen too often in the region, but have been shown to work really well in other cities.",
    "I get your take.  I guess I should clarify that my issue is more with the design proposed for this bike lane that looks like it will lead to more bicycle-to-motorist interactions, which are super dangerous for cyclists.  Also, the removal of a lot of parking is a problem.  Troy already struggles with parking and this will make popular events tougher for people to come to Troy.",
    "First time, eh?",
    "Lol I wish it was. This is the worst I've seen it in a very long time",
    "Yeah I watched them for a few years after I graduated, but I just had to stop for my own health lol",
    "Is nil money ruining hockey now too? I'm guessing rpi has about $0 for nil",
    "Western Michigan won the NCAA championship without any NIL money.  Simple formula:  A solid coaching staff built a great team.\n\nIronically the associate head coach at Western was available to the last two RPI search committees and didn't even once get a call.  He's only won it all three times, twice at Minnesota-Duluth and last year at Western Michigan.  Our coaching search team is terrible.  Hopefully I'm wrong about Lang...",
    "For the mens, the previous coach got fired at the end of last season, and because of that a bunch of players transferred out of the program bc thats how college sports works now unfortunately. Another large group of players were seniors/grads and moved on as well. The new players are all young but have good potential, but yeah its gonna take a while. It doesn't help that they've played all really good teams so far, every team but one was nationally ranked (which isn't as difficult to do compared to college football but still). So its bad right now, but in time the team should improve significantly in the near future, the new coach &amp; assistant coach are good and RPI is finally investing in the program again. The womens team...\n\nIt looks like its approaching rock bottom. The coach should have been fired years ago (he was the same guy whos led the team to [this](https://rpiathletics.com/sports/womens-ice-hockey/schedule/2019-20record) record in \\*2019\\*). And one of our best players last year transferred to Clarkson, the team that just curb stomped RPI this parent's weekend 7-1. Imo the team needs a rebuild like the mens team and fast.\n\ntldr its shirleys fault",
    "He should have been fired years ago yet somehow just got a long term extension before the season",
    "New coach, effectively a new team...  Give it time.  They've only had 4-5 weeks to gel together at this point, and most other teams kept an intact core for years on end by contrast.\n\nIf we haven't gotten it together by end of the year, I am going to have some concerns to put it lighhtly, but for now, have patience.",
    "We were joking 25 year ago about the \"Pathletics\" especially after they introduced the first iteration of the website.\n\nhttps://rpiathletics.com/",
    "I feel like Seth Appert got a bit of a raw deal with RPI.  I wish him well with the Sabres as an assistant coach.",
    "RPI couldn't handle his hair. It's too powerful.",
    "It is borderline Pierce Brosnan level of power.",
    "Were you gone the last 7 months? The men's team had a coaching change and had its best players leave because of it. That program has a full rebuild ahead but hired one of the best coaches in the country. This year will be rough but they'll be good in a couple years.\n\nAs for the women.... no idea why but they inexplicably extended their head coach despite being terrible every year. Never finished above 8th. That program seems destined to stay sucking because they've clearly just accepted that as the standard",
    "Go to games. Yell and cheer a lot. You'll still have fun.",
    "Is there any chance we don't get destroyed by Union this weekend? I'd like to not feel horrible after leaving a game for once.",
    "Probably not chief, sorry. This is a brand new team, brand new coach. It will take several years for them to rebuild",
    "While the jury is still out on tomorrow, tonight's results show promise with the win over Union.",
    "Shit! Good on them! \n\nThere is often an extra edge at Blackout because of the crowd energy. Must've been really fun!",
    "I’m new to the school but why doesn’t the football team get any love? Is it because it’s D3? They are really good this year and the home games have been enjoyable",
    "Yes because it's D3. It's also just not part of the school's culture in the same way that Hockey is.",
    "Really is crazy that back in 1925 we opened the football season at Harvard, held them close, and didn't manage to parlay that into bigger things. The modern day equivalent would be opening the season at LSU or Alabama.",
    "Well, we also won the NCAA hockey championship twice (many years ago, but not long enough that our culture doesn't remember). That is a big part of what propelled hockey's popularity at RPI",
    "Class of 1985, baby.   35-2-1.  \n\n&gt;Adam Oates (HOF, top 10 all-time NHL assists)\n\n&gt;Darren Puppa (NHL all-star)\n\n&gt;Ken Hammond (Kings)\n\n&gt;John Carter (Bruins)\n\n&gt;George Servinis (North Stars, Canadian national team)\n\n&gt;Mark Jooris (Canadian national team, European pro leagues)\n\n&gt;Kraig Nienhuis (Bruins)\n\n&gt;Tim Friday (Red Wings)\n\n&gt;Mike Dark (Blues)\n\nNine players who played pro, including two NHL all-stars.",
    "I believe the other one was way back in 1954.   I was a freshman in Sept of 1985 so I didnt get to experience the championship, but very much saw the \"afterglow\".\n\nThough he came a little later in the 80s, I lived next door to Graham Townshend in BARH....not the first black NHL player but I think the first of Jamaican ethnicity and definitely one of the earlier ones.   In recent years he's tried to get a hockey equivalent of the Jamaican bobsled team into the Olympics.",
    "We were in the ncaa tournament about 15 years ago. Man how things have changed",
    "Yeah when I was there in the late 1980s no one cared about football, or anything but hockey either.   NY isnt really a college football state anyway.....2 SUNYs are division 1 (Albany and Buffalo) and until my daughter went to UB 5 years ago I had no idea and thought they were Div 3.   \n\nI think Syracuse is the only Division 1 football in NY with national buzz and even they are more known for basketball (though they have the only domed stadium in the Northeast)",
    "The women's game v. Clarkson this past weekend was as lopsided as I've ever seen... and I've coached youth hockey.  50 shots to 10 or something like that.  If it weren't for the goalie, RPI would've easily given up 15 goals.",
    "For those who watched tonight's hockey game, seeing our team beat Union 5-2...  All I have to say is 😀.  We stayed with them the entire game, only permitted 1 goal on a 5 minute major penalty kill (getting a short-handed goal of our own on them in the process), etc. - pretty solid showing overall.\n\nRPI has been playing solid, highly-ranked teams for most of the non-conference schedule, while Union might have been undefeated but they were playing relative cupcakes.  Lo and behold, who came out on top?",
    "Nothing is better than beating Union, gets me believing again",
    "new coach is promising, he made AIC a competitive program, they’ve also had a gauntlet of a schedule, prob should’ve beat Miami but then BC Providence and Minnesota State are all heavy hitters compared to us, focus for this year should be to be in the running for a home playoff game",
    "The football team is pretty good and poised to make the post season. Go to those games.",
    "nah deadass cause how do you lose against a team you beat the day before 💀",
    "Alum from 1989 and havent followed in years so this is sad to hear",
    "[removed]",
    "All of the (Men's) hockey players are business majors anyway. At least like 99% of them. Lots of the women too, but more of them study the sciences and engineering.",
    "We are working on fixing the pre-req for the course so if you need an override while we fix that please email Dr. Galloway with your RIN and she will put in an override for you.",
    "Acacia is hosting a bonfire tonight at 7pm. If you want to hangout around a warm fire with chilli, burgers, s’mores, and more, come by and hangout!\n\nNeed a ride up or have any questions? Text Jackson at (914) 582-0060",
    "I took NumComp with Lvov 16 years ago, so any of my opinions would be irrelevant. But we still tell stories about taking NumComp with Lvov, so I'd say it was worth it. ",
    "In diffeq he locked the classroom when students left to use the bathroom as a prank. He also roundhouse kicked the projector machine and I don’t remember why.",
    "In Fall 2014 DiffEq, he took a big swig of water to spit on a student in the front row who kept talking after he warned him to stop",
    "I've given this post a few days to see if anybody more recent than me responded to you. That did not happen, so here I go.\n\nYuri Lvov is probably the most polarizing professor I've encountered at RPI in my 14 years here. People either love him or hate him. My take is that which side you fall on depends primarily on one thing: how good are you at learning?\n\nIf you are the kind of person who understands material after getting it explained once, or can complete examples alongside the professor's lecture, you will enjoy Lvov's style, which is basically explain once and do a couple examples, with random anecdotes and other antics interspersed to break things up. After that, he moves on to the next concept.\n\nIf you can keep up with him and are mentally nimble enough to turn on a metaphorical dime, you'll love his class. If you are the kind of student who needs material repeated frequently, or several examples to grasp a concept, you'll have a rougher time.\n\nPersonally, I greatly enjoyed Lvov's Num Comp. It was probably the single most useful course I took as an undergraduate. However, I understand why many people dislike his style.",
    "To answer your questions imo:\n\n1. CANOS is harder than CoCo but both classes are not bad and are solid\n\n2. Algo is prob harder than DS/FOCs nowadays. DS back then was harder than both FOCs/Algo then but that’s just me\n\n3. Circuits is definitely harder than Embedded and uses a lot more math and theory than embedded does. Embedded is just a microcontroller programming course\n\nOverall: it seems like a bad idea to take em all in the same one but if you believe in yourself go for it",
    "Circuits it absolutely your most important class out of these, but also the hardest and most time-consuming. I would not do Algo and Circuits at the same time. CANOS + Circuits should be fine though.\n\n\n...\n\nGod I miss Hameed  😢",
    "Thats what its telling me to do on the pdf💀",
    "It's definitely doable. Will still be less hell than DS. Circuits is probably the second-hardest CSE core class, but that also depends on your relative ability at coding vs. Circuits and math",
    "Easier than xiao ds?",
    "I don't know, I didn't have that professor. Did you do like 20 hours of homework per week?",
    "No :(",
    "Well I guess it's good they made the class a bit easier then.\n\nCircuits combines time management with somewhat complex math and problem solving. I found the content to be pretty fun. It's basically Intro to ECSE, but with differential equations! Lets you solve much bigger and more complicated circuits.\n\nWhen I took the class with Sawyer, she was doing an experimental flipped style where we were mostly doing exercises with some lecture scattered in, rather than the other way around. That isn't the norm though, and I can't speak for any other professor.",
    "I thought canos wasn’t offered in the spring semester???",
    "It says it is on rpi site",
    "Circuits was harder but embedded took more time. Canos was easier than coco but that might just be the shitty prof I had for coco",
    "I'm taking circuits and embedded right now. Circuits is way easier imo. But I also suck at programming",
    "algos isn’t too terrible, i took it last spring and every homework was pulled directly from the textbook and every exam question was also from the textbook or copy pasted from a previous years exam— as long as you look at the book and/or back exams you’ll have an easy time",
    "IED will be more of a semester long group project, with a larger group, whereas Inventor Studio is split into two projects, one with a small group and one that is done individually (or by pairs). Inventor Studio focuses more on identifying problems and innovating solution ideas for them while IED is focused more on a single engineering design. In IED, you can lean on your teammates more to fill tasks you are not as good at, but at the same time your project's success and grade is more influenced by the team than your individual capabilities. Both will take up a lot of time.\n\nWithout knowing your goals and interests, I cannot recommend one over the other, but hopefully these distinctions will help you make the decision.",
    "IED is a lot more work than Inventors studio. Unless you're super interested in what IED has to offer, that should probably be your main concern. I'm in IED right now, so feel free to reach out with any questions you have!",
    "Did anyone attend last night? Is anybody planning to go tonight?",
    "The event raised over $4000 for their chosen charity, the Ability Experience.  thank you to all who visited. \n\nhttps://www.abilityexperience.org/",
    "i thought brown’s was pretty rough, like i didn’t do that well on the tests and found them more difficult than the HW, but maybe that’s just me. never had stevenson so i can’t comment but i’ve heard some good things",
    "Stevenson 100%. Brown's exams are absurdly long, her multi class was the first C for many people I know",
    "brown",
    "I liked brown\n\nShe makes you memorize more than Stevenson, her lectures can be a bit boring, but she is a good professor",
    "I prefer Stevenson a lot more. Brown has good notes meh lecturing style. Stevenson, great guy mediocore handwriting and can be a bit too laid back at times. I'd say both are good but it depends on what sort of personality you prefer. Also brown doesn't have back exams for some reason so you gotta go to APO and she has harder exams.",
    "Congratulations on the new cat",
    "If you still have the kitty maybe check for a microchip just in case. There have been a few posts about missing cats on the Troy subreddit.",
    "He’s been around for a few days, my friends try to feed him on freshman hill",
    "I believe it is a stray that lives around freshman hill. We’ve seen him a number of times at sage he’s really friendly.",
    "Why do I never get to see random cats in the street? :(",
    "he's out a lot at night around freshman hill or sage dining hall",
    "I’ve seen food being placed outside the playhouse for him near the bridge. He’s definitely going to stick around campus with all the free food, but winter is coming and he’s a little underweight.\n\nI feel like he’s abandoned since he’s so friendly, maybe lost, but he’s more than old enough to be neutered if he had an owner.\n\nPerhaps cat distribution system at work if you’re not in the dorms ;)",
    "That was my food :P \n\nI talked to some other students and one said he was a stray in a park in Troy who followed him up to campus, so I'm going to take him to a vet to see if he has a chip + test for FeLV and FIV and go from there",
    "Always make sure to check lost postings and a vet check for a microchip just in case",
    "I'm afraid it won't survive the brutal winter if it's an outdoor cat.",
    "yeah that’s zoos cat i think",
    "Nah, their cat is all black",
    "The instructions to get syllabi can be found here:  [https://provost.rpi.edu/institutional-research-and-assessment/learning-assessment/heliocampus-syllabi-access-students](https://provost.rpi.edu/institutional-research-and-assessment/learning-assessment/heliocampus-syllabi-access-students)",
    "This is awesome, had no idea there was a means of getting syllabi. Meanwhile the actual syllabus function on SIS remains unused.",
    "I had Shankar Narayan for heat transfer a couple years ago, I have fond memories of the class. He’s a good prof. Can’t comment on how he compares to Samir A. Salamah.",
    "Do you know… if there are multiple heat transfer profs,  do they have the same exams?",
    "no",
    "I had Narayan. He was very good and approachable",
    "I had a landlord complain about a $1000 repair while living in a house generating close to $5000 a month in rent. Give them hell.",
    "commies go away",
    "I believe it is, so long as you aren’t threatening yourself or others.",
    "Yeah I more mean like alcohol / drug policies",
    "Yes, they are confidential about that stuff",
    "Yep",
    "Yes, however there have been issues in the past of students being reported to RPI for having suicidal thoughts and being forced into medical leave. But they are legally required to be confidential unless they think you're a risk to yourself or others",
    "No, likely not — that’s my guess. So long as you show strength in the curriculum that is readily available to you.\n\nThat being said, it might not be bad to look into taking it at a community college if that’s feasible. The credits might not transfer but it’ll show the school that you’re really trying to keep to their standards.",
    "I plan on doing this but I just wanted to make sure ",
    "Good to check! I’d say this is probably a general rule for all schools, but when it gets really competitive (e.g., MIT) you’ll probably end up being weeded out on very minor differences.",
    "I took calculus at a community College during my senior year of hs,  and rpi took it for calc 2. Ymmv",
    "approving this bc it's a less common admissions question, but you should probably just ask admissions.",
    "as long as you take precalc you’ll be fine (i don’t think you can get admitted if you’ve never taken precalc)",
    "Maybe a little, but there are tons of students who take it at RPI",
    "I recently attend a tour and they said calculus was not required on your hs transcript to be considered.",
    "Your submission was removed because it looks like a \"Chance Me\" post or a post about Rensselaer Admissions.\nThere are no admissions personnel on /r/rpi and current students and alumni are not qualified to get a satisfactory answer,\nas we do not have access to admissions standards and conditions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RPI) if you have any questions or concerns.*",
    "you still need them?",
    "If you have one for exam 3 !!!!!",
    "give me a bit to check :)",
    "hey could i get the back exams as well for exam 1,2,3 too pls?",
    "Yes, do you think u can dm me them if u have them still",
    "Acacia is hosting a bonfire tonight at 7pm. If you want to hangout around a warm fire with good food and s’mores, come by and hangout!\n\nNeed a ride up or have any questions? Text Jackson at (914) 582-0060",
    "I think you're gonna have trouble finding leases that allow 2 people to share a room\n\nI would also imagine not many people would want to have n+1 people living in their n person apartment",
    "Yeah but we’ve shared a room since we moved to school so it can’t hurt, and it helps with money for both of us because we can’t really afford 2 different rents",
    "I'm saying that it physically won't be an option for most leases, and that people are not gonna like the idea of you guys paying 1/4 of the rent but being 2/5 of the people living there",
    "I understand that, but I have had landlords say it’s okay and so it can’t hurt to ask and request it even if they say no.",
    "You need to consider it's mildly unreasonable for you and them to pay half as much while the other room mates pay the same amount for effectively less space. You need to remember you two are basically going to be like having a roommate that uses the common area twice as much as everyone else on top of bringing a cat into the small apt.\n\nAlso what's the contingency plan if there is an ugly breakup?\nThe worst case scenario for y'all is literally a thermonuclear bomb",
    "It’s not unreasonable when I’m doing it right now lol, and crazy enough we’re engaged? \n\nYou can just scroll, there’s no reason for you to get this pressed.",
    "Ring by spring??? Nightmare fuel roommate scenario",
    "I didn’t meet them here, I’m not a freshman, and also this genuinely is none of your business",
    "You posted it to the Internet asking for advice, I gave you the best advice I could think of. Don't share a room, it's inconsiderate to the other roommates",
    "My lease is up on 15th st this June, it’s technically a 2 bedroom but my partner and I use it as a 1 bed plus an office. We also have a cat! Dm me for more info",
    "As could be gathered from the name of the course, the class is about aerospace propulsion, with particular attention paid to turbine engines. You'll learn the operating principles of jet engines and how to analyze certain elements of them. We also did a bit of analysis of propellers and rockets, but I remember jets being the main focus of the course.\n\nI haven't looked at the course since I took it back in the day (around 2013), but I remember it being around the same level of difficulty of my other 4000-level MANE courses. If you are interested in jet engines and are comfortable with fluid dynamics and thermodynamics, I'd say go for it.",
    "If this is with Oehlschaeger, absolutely take it. By far one of my favorite classes and the Oehlschaeger is a phenomenal mentor and professor!",
    "Heat Transfer is a co-requisite for TFL, you must take it at the same time or before taking TFL",
    "I did it last fall. It's doable, but definitely not a fun time. I'd definitely avoid it if possible. Also, if you can, take TFL after heat transfer since you'll need some of that knowledge right off the bat for homework 0.",
    "I love thifting! Im not a student anymore (Lally class of 2011) but I could try and help somehow.",
    "I sent you a DM :)",
    "Im interested !!",
    "I'm an undergrad so I can't necessarily comment on what the grad experience will be like, but as a school overall RPI is pretty good. The professors are all very clearly knowledgeable of the content they're teaching and a lot of the time have applicable industry experience to give you a sense of how you can apply the things you're learning, and are very willing to help their students succeed. The administration has been doing a fairly good job at communicating with the students their plans and intentions for the campus and community, a stark contrast to what I've heard it was like 10 years ago. At least as an undergrad there are tons of events and clubs to join to socialize, and I see advertisements for graduate student activities quite frequently if you're looking to get involved with the community, but I don't know any specifics about them. \n\n\nTroy definitely isn't the worst city but it could be better. I've never felt unsafe walking downtown or around the outskirts of the RPI campus, but the campus security does send out occasional emails about thefts and car break-ins around the area. Last month there were a few shots fired in the middle of the night but it didn't seem like anything violent, just someone keeping the property value down. If you lived very close to campus you'd probably never really notice anything. \n\n\nIn terms of just living here there's all kinds of stores about a 10ish minute drive from the campus so you'll never have to travel far for most household items and groceries. If you're looking for places to live there's tons of apartments, rental companies and landlords with properties both right next to campus and in the Troy area in general, with rent ranging typically anywhere between 400-900/month. There are CDTA buses that are free with RPI ID and stop right next to campus that can take you around Troy or into some neighboring cities like Albany, Saratoga or Schenectady, albeit not very quickly. \n\n\nI hope this was helpful :) ",
    "Currently a MS in Mechanical Engineering student. \n\nI’ve been in your shoes before, reading all the bad comments about the previous administration. But I have to change it is not like that, great administration that cares for students and a lot of research labs with great professors. With the new center CSCMS coming up soon even more opportunities for the school will Open up. \n\nOf course it will be challenging and demanding, but If you want to succed it is like that. You will probably be able to find other students with similar interests as you social/academic. \n\nIf you are looking for a big party life you won’t find it here, it is easier to focus on academics and grow your career. Community seems to struggle in the social aspect but If you find the right people you’ll be fine. You can walk anywhere as well. \n\nDepends on what you are looking for, here you’ll find good academics, administration and research. Lack of social life depends on Who you hang out with, but have Montreal, Boston and NYC 2-3h away. Great farmers Market on Saturday!",
    "Thanks for the info! Good to hear that things have changed. I barely go to parties so it sounds great. Can I DM you for some more details regarding the uni?",
    "Thank you so much for the detailed answer. It was very helpful.",
    "I have 13 exams this semester, where maybe if I'm lucky, 2 to 3 weeks with no exams, and on average, I have at most 1 week to study for a given exam due to so many projects and homeworks across my courses.",
    "2 weeks-3weeks exams\n3 exams in 2 days\nWeekly quiz\nQuiz every other week",
    "Some classes unfortunately just have way more going on than others and unless someone tells you about it beforehand you wont find out till you get there. Multi is one of the worst offenders with 4 exams and 8 quizzes, so if you have even just two other classes with regular exams (3-4 exams over the semester) you end up feeling bombarded. \n\n\nI had a semester where the only weeks I didn't have exams were the first two weeks of the semester, it was incredibly overwhelming but once you get into a good flow of managing tasks it gets at least manageable",
    "You guys have exams?\n\n(I'm taking 3 gsas classes this semester and my life is project after project after project. I miss when all I had to worry about was exams. AAAAAAAAAAAAAAAAAAAAAAAAAAA)",
    "Mines weekly as well. I have midterms for 5 different courses so like I’m just cooked but that’s just how it goes here. I just take them on one at a time do enough back exams where I get at least an 80 on 2 of them. It’s a lot more reassuring because I already have a good idea of the score I will get before I even enter the exam hall.",
    "I could help, but it would have to be online. Let me know?",
    "troy tutors !",
    "Hi! I do one on one tutoring thru Troy tutors, I’d be more than happy to help get you set up with some times to meet. Send me a DM if interested",
    "You can DM me and we’ll set you up with a tutor.",
    "I believe once you are a tenured professor and you leave an institution to begin a higher rank, you hold the title for life. Traditionally professor is a rank/title, not just a job.\n\nHe was a professor at MIT in the late 80s-90s\n\nEdit: it seems he is also the current holder of the Ray and Maria Stata Professorship. So needless to say he’s got a couple reasons to hold the Professor title.",
    "Very cool! Thanks for the insight",
    "Although university presidents typically are appointed as professors with tenure, most of them don't actually teach classes while they are president.\n\nIt's typical for presidents, provosts, and other high-level academic administrators to have \"the right of retreat\" to return to a faculty role if they're dismissed.  Daniel Berg held onto his tenured professorship in Management for years after he lost the presidency of RPI.",
    "It is also a way to bury some additional income in a different budget line.",
    "Hello! I'm a fellow landlord here, and we should be able to work something out with you guys! What's a good way to get in touch with you guys? Here's our website: [TheCoveRPI.com](http://TheCoveRPI.com)",
    "This might literally have been my quad room in 2013. Why change tradition?",
    "This was the same exact furniture we got in 2009, i remember trying to balance on the little tilted part of those chairs lol",
    "I couldn’t pull my chair all the way out.  I had to hop over the side to sit.",
    "Also, at least there's a drawer for under the bed. I was a summer camp counselor for an overnight camp and I stayed in a lot of different RPI dorms. Don't remember under the bed drawers. And most of the rooms they put the counselors in were triples shared with max 1 other camp counselor.\n\nI'm so happy those days are behind me.",
    "Graduated in 2021 - quad still looks exactly like this",
    "Ik it’s small but I prefer this over the double room I got freshman year. Basically 2.5 times wider but two beds.",
    "Photo looks like it could’ve been taken today! Crazy how nothing changes!",
    "Genuinely no change except the price has nearly tripled haha.",
    "Yeah. A few dorms have AC, like North, and a few others have Ethernet, but aside from that literally nothing has changed",
    "$11,040 these days…",
    "I feel like my dorms looked fairly similar... Am I missing something? It's a room with some furniture...",
    "Can confirm, the quad singles look exactly the same now",
    "I guess no one remembers the E dorms….",
    "The mice remember ",
    "E Dorm Veteran - didn't have mice but the place was a dump",
    "Arch 2024 - had mice and fire drills ever other day",
    "Well now this is all you get for 11k in room and board",
    "I know that’s probably the joke but my quad room looks literally EXACTLY like this except the bed and desk are on different sides(and I have decorations, obviously)",
    "I was actually in a room almost IDENTICAL to this during 2023-2024. Shit was cramped.",
    "Looks the same",
    "I remember visiting people in the quad and being jealous of how close they were to campus. I spent 2 years in North Hall and was in some ways, even closer.",
    "Some were. I too lived in the quad. Caldwell dorm. I did get something that I have to this day. Foot fungus.",
    "I moved into one of those in 1997",
    "I was in church VI in 97-99 ...... Little better in the doubles but shit never changes",
    "I was in quad last year, my room looked identical to this. Window didn’t even open and everything",
    "I was in, I think Church III for 98/99. Mirror image of this room.",
    "Thanks for making me feel old lol",
    "Wow",
    "Hmmm mine was also like this, I had a great time.",
    "Crockett 3 for the win.",
    "Crockett 3, 1984-85",
    "Looks a lot nicer than Cary/Bray from the 80's.",
    "that looks like a prison cell with a view :-/",
    "That was my exact room last year. Payed 11k lol",
    "Most bathrooms I've seen are larger than this.\n\nI graduated in '77, lived in BARH.  A nice place, back then.  Decent sized doubles, decent sized singles.  \n\nBut, by the time I left, the singles were being turned into doubles.  And I stopped by and visited back around 2009 or so; the doubles had been turned into quads.\n\nWhy, RPI, why??  \n\n(And yes, this really is a general college trend.  Two daughters lived in similarly oversubscribed rooms.  People trying to learn and evolve as adults, stacked like cordwood.  Meanwhile, college Psych departments happily experimenting on behavoral issues when overcrowding rats in cages; they could have easily saved the cost of the rodent-based labs.)",
    "Wait... I was in BARH during the time OP took that pic. You mean to tell me that my BARH double now rooms 4??? The singles into doubles??? Those were so small...!",
    "Hmmmm looks like my room in Church V in 1978. Except I lofted the bed higher to put the desk underneath. Fortunately I’m super short and could still sit upright in the lofted bed.",
    "This looks like the upstairs of the Quad in 2002.  I lived in the basement but this was definitely the top floor.",
    "Haven't been to the Tute in years (I'm class of '89) but my son was a dorm student at Western CT State U a few years ago and his room looked like that.  Things havent changed",
    "I think I applied and did the asynchronous interview within a couple weeks. Then I didn't hear anything from them until I got my real interview over Thanksgiving break, and it was locked down soon after that. All I can say for now is to take your time with the asynchronous one to get it right. That's what managers and HR people are looking at to see if they want to interview you, so think of it like you're actually talking with your interviewer. Your personality will carry you a long way.",
    "Thank you so much! I just finished the asynchronous!",
    "Students fulfill ILEA 4400 through one of the following **experiential learning options** (each requiring a minimum of **260 hours per term**, unless otherwise noted):\n\n* **Internship:** One-semester paid position (minimum 260 hours).\n* **Co-op:** Multi-semester, full-time paid work experience (approximately 40 hours per week).\n* **RPI Research:** One-semester research experience with RPI faculty or staff; may be for credit, paid, or volunteer (minimum 260 hours).\n* **Civic Engagement:** One-semester experience with a nonprofit or government agency (minimum 260 hours).\n* **Self-Design:** One-semester customized experience aligned with personal career goals; must demonstrate development in at least six of the eight NACE competencies (minimum 260 hours).\n* **Study Abroad:** One-semester academic experience through an affiliated or non-affiliated international program, coordinated with RPI’s **Office of International Programs**.",
    "What about summer research?\n\nIn my [op/ed](https://poly.rpi.edu/2015/09/16/new_idea_sparks_concern/) a decade ago (yikes!), I mentioned my NSF-REU experience. You'd think that surely that would count. If NSF isn't doing those programs anymore, surely other programs exist. It was full-time 40-hour weeks of research for 7 weeks at another institution where I lived in their dorms (for free). Very formative and important for my varying decisions around grad school. Did this and a SURP.\n\nI'm now a PhD student at a highly ranked program for my field after working for a few years and getting a master's at *the* top program in a related field. So clearly something worked...and this isn't an unusual tale among alumni from my year!",
    "Awesome op-ed! I'll reach out and ask about non-RPI research. Will follow up once I get an answer",
    "Well, summer research in general. An RPI SURP at 10 * 35 hours should surely count.\n\nI also hold true to my statement that any job is helpful. When I was at RPI (graduated 2014), there was a subset of students who wouldn't work part-time unrelated jobs, either, in addition to not finding meaningful summer internships and the like. At interviews during various stages of my career, I've given examples from my part-time semester jobs. I've always understood the need to encourage students to seek out something besides just coursework, but this can be gathered through a part-time job putting food on the table and paid summer research like I did. I'm glad to see that Marty is seeing sense that this requirement should have more flexibility.",
    "Hello! Just got word back! RPI research and non-rpi research counts for your away term!  \n\\&gt; Yes, any REU experience would be registered by the student as ILEA 4400 - Internship. They can self-register for that starting Nov 3 when registration opens. they will still need to submit the offer letter and some supporting docs but it will absolutely count for the Away term.",
    "Oh, good! Glad to hear that they finally saw sense. Most students should be able to meet one of the requirements naturally, without having to spend the summer living in the dorms in Troy! I was so glad I graduated before it was a thing.",
    "And I am the first class that arch was necessary, fuck my life too I guess",
    "Haha me too",
    "And my away semester was spring of 2020, so fuck me double",
    "Wars over",
    "Very interested in understanding the “why” behind this. Why now? Has RPI pulled themselves out of the financial issues that caused Arch to be mandatory in the first place? Was that done largely through alumni donations after Shirley left? Has the Arch program been as successful as anticipated? How many students sought and were granted exemptions? Were prospective students not coming to RPI because of Arch? There must be a bottom line of an Institute finance document supporting this change, but how is the equation changing? Looking forward to hearing more about this.",
    "A lot of it seemed to just be student input! Nobody really liked being 'forced' to do the Arch Summer semester. They mentioned that students essentially had to lie and say they intended on staying for the summer (when in reality, they were searching for internships and planned to get an exemption.) This meant that numbers were not forecasted well– and made budgeting for Arch harder. (As such, the quality of the program decreases, too.)\n\nThey do want to keep the summer semester an option, and there's a big emphasis on having students play a key role on reshaping these new programs to ensure that there's still a reason to stay over the summer. (Fun events, unique opportunities, etc)",
    "sooo does that mean that there is going to be even less class options over the summer...",
    "I always heard Arch was kept a bit after Shirley left because of how big the class of 26 and 27 are: now that those classes are both upperclassmen now the overcrowding issue is gone",
    "That was one of the original justifications for the program - that with Arch they could admit more students since some of the students would be gone the one semester. I remember arguing to the administration that they needed metrics to define what success and failure is, and they said they would put those in place, but I never saw anything.",
    "I'm class of 2027, supposed to do arch this year after taking a leave. Fuck my life I guess",
    "talk with your advisor if possible, the chart they made does account for LoAs, and I do assume that would be adjusted for w/ regards to summer semesters\n\n  \nmore importantly, arch exemptions have been incredibly lenient in the past few years, and (from my personal understanding) this is just a more official way of going about that entire exemption process.\n\n  \nLater in the week I'll clarify with the CCPD how the summer requirement will work for those who took a LoA and report back",
    "Just got word back– \"No summer term is mandatory anymore so they just need to take the ILEA 4400 and ADMN 1030 at some point before they graduate.\"\n\n  \nAs long as you complete those two requirements, you should be all set!",
    "ADMN-1030 is a 0 credit prep class for your Arch Experience. Basically throughout the semester you'll be polishing up your resume, researching companies and applying to internships. The course should be taken the Spring of your sophomore year, unless you do an early Arch, so i wouldn't move that around. \n\n\nI would recommend taking a HASS course next semester if you want to reduce your credit load in third year. Most HASS courses are pretty easy and low time commitment, and still count towards your graduation requirements (your Pathway or general HASS credit count). If you'd rather something more related to your degree and already have the prerequisites, Physics II or Multivariable Calculus are medium difficulty courses that are moderately time consuming but not *too* bad, and the quicker you complete them the sooner you can have more options relevant to your major. ",
    "I just realized I misunderstood your situation, ignore the part about physics and multi just do a HASS course",
    "ECSE 2900 is a seminar class. It’s a required class where you literally have a single group presentation to present throughout the semester and that’s it. Your presentation date is randomly assigned and so is your topic. You’ll be notified in 2 weeks about your project and it’s a pretty easy class as long as you don’t abysmally mess up your presentation. Free A basically.",
    "I’d recommend moving up a hass if you’re stuck in pre requirements with only 13\n\nECSE 2900 is a seminar where you get lectures from a bunch of different people in their respective fields and then it’s just a crap ton of group presentations. Fairly easy and simple class. \n\nYou should talk to your advisor though.",
    "Left on read",
    "Find when their office hours are and just show up. Sometimes its the only way to talk to some people, and gets you immediate answers ",
    "Acacia is hosting a bonfire tonight at 7pm. If you’re still around for the 3 day weekend, and want to hangout around a warm fire with good food and s’mores, come by and hangout!\n\nNeed a ride up or have any questions? Text Jackson at (914) 582-0060",
    "The asterisks and other symbols by courses is to track any cross or co-listed courses.  All exams can be changed but at this point that should be very unlikely.  Email your instructors with the date for their exams to inquire that whether the posted dates are the actual/final dates."
]